# GetPanel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GetPanel Method
PanelScheduleView Class See Also
---
Gets the panel for this view
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetPanel()
```

Visual Basic
---
```text
Public Function GetPanel As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetPanel()
```

# ### Return Value
The id of the panel for this view
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace